4ms/mp153-devboard/mp257/cubemx/mp257-devboard/mp257-devboard.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
ADC1.CommonPathInternal=ADC_INTERNAL_NONE
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master,CommonPathInternal
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
ADC1.master=1
ADC3.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_6
ADC3.CommonPathInternal=ADC_INTERNAL_NONE
ADC3.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,CommonPathInternal
ADC3.NbrOfConversionFlag=1
ADC3.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC3.Rank-0\#ChannelRegularConversion=1
ADC3.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
BootROMA35.IPs=BSEC,HASH,IWDG1,IWDG2,LPDMA1,RCC,RNG,STGEN,GPIO,TAMP,SDMMC1,USB3DR,OCTOSPI1,OCTOSPIM,PWR
CAD.formats=
CAD.pinconfig=
CAD.provider=
CortexA35NSOS.IPs=CORTEX_M33,HPDMA1,HPDMA2,HPDMA3,LPDMA1,RCC,GPIO,GIC,DSIHOST,LTDC
CortexA35NSSSBL.IPs=HPDMA1,HPDMA2,HPDMA3,LPDMA1,RCC,GPIO,GIC,DSIHOST,LTDC
CortexA35SFSBLA.IPs=BSEC,DDR_CTRL_PHY,LPDMA1,RCC,RIF,GPIO,TAMP,ADC3,ADC1,ADC2,DEBUG,GPU,I2C7,SAI1,USBH_HS,SDMMC1,DCACHE,ICACHE,SAI2,LVDS
CortexA35SSecureOS.IPs=BSEC,CORTEX_M33,DDR_CTRL_PHY,HPDMA1,HPDMA2,HPDMA3,LPDMA1,RCC,RIF\:I,GPIO,GIC\:I,LTDC,TAMP,USB3DR,DCACHE,ICACHE
CortexM33NS.IPs=CORTEX_A35,HPDMA1,HPDMA2,HPDMA3,LPDMA1,RCC,SYS\:I,GPIO,NVIC2\:I
DDR_CTRL_PHY.A10=RASN
DDR_CTRL_PHY.A11=A11
DDR_CTRL_PHY.A12=A0
DDR_CTRL_PHY.A13=A6
DDR_CTRL_PHY.A14=A8
DDR_CTRL_PHY.A15=A2
DDR_CTRL_PHY.A16=BA0
DDR_CTRL_PHY.A17=A10
DDR_CTRL_PHY.A18=-
DDR_CTRL_PHY.A19=-
DDR_CTRL_PHY.A20=A4
DDR_CTRL_PHY.A21=BG0
DDR_CTRL_PHY.A22=ACTN
DDR_CTRL_PHY.A23=WEN
DDR_CTRL_PHY.A24=-
DDR_CTRL_PHY.A25=A5
DDR_CTRL_PHY.A26=A9
DDR_CTRL_PHY.A27=BA1
DDR_CTRL_PHY.A28=A13
DDR_CTRL_PHY.A29=A1
DDR_CTRL_PHY.A30=A7
DDR_CTRL_PHY.A31=A12
DDR_CTRL_PHY.A9=CASN
DDR_CTRL_PHY.ADDRMAP0_REG=\#define DDR_ADDRMAP0 0x0000001f
DDR_CTRL_PHY.ADDRMAP10_REG=\#define DDR_ADDRMAP10 0x06060606
DDR_CTRL_PHY.ADDRMAP11_REG=\#define DDR_ADDRMAP11 0x00000006
DDR_CTRL_PHY.ADDRMAP1_REG=\#define DDR_ADDRMAP1 0x003f0808
DDR_CTRL_PHY.ADDRMAP2_REG=\#define DDR_ADDRMAP2 0x00000600
DDR_CTRL_PHY.ADDRMAP3_REG=\#define DDR_ADDRMAP3 0x1f000000
DDR_CTRL_PHY.ADDRMAP4_REG=\#define DDR_ADDRMAP4 0x00001f1f
DDR_CTRL_PHY.ADDRMAP5_REG=\#define DDR_ADDRMAP5 0x060f0606
DDR_CTRL_PHY.ADDRMAP6_REG=\#define DDR_ADDRMAP6 0x0f060606
DDR_CTRL_PHY.ADDRMAP7_REG=\#define DDR_ADDRMAP7 0x00000f0f
DDR_CTRL_PHY.ADDRMAP8_REG=\#define DDR_ADDRMAP8 0x00003f01
DDR_CTRL_PHY.ADDRMAP9_REG=\#define DDR_ADDRMAP9 0x06060606
DDR_CTRL_PHY.CL=24
DDR_CTRL_PHY.CRCPARCTL0_REG=\#define DDR_CRCPARCTL0 0x00000000
DDR_CTRL_PHY.CRCPARCTL1_REG=\#define DDR_CRCPARCTL1 0x00001000
DDR_CTRL_PHY.CWL=18
DDR_CTRL_PHY.DBG0_REG=\#define DDR_DBG0 0x00000000
DDR_CTRL_PHY.DBG1_REG=\#define DDR_DBG1 0x00000000
DDR_CTRL_PHY.DBGCMD_REG=\#define DDR_DBGCMD 0x00000000
DDR_CTRL_PHY.DBICTL_REG=\#define DDR_DBICTL 0x00000001
DDR_CTRL_PHY.DERATECTL_REG=\#define DDR_DERATECTL 0x00000000
DDR_CTRL_PHY.DERATEEN_REG=\#define DDR_DERATEEN 0x00000000
DDR_CTRL_PHY.DERATEINT_REG=\#define DDR_DERATEINT 0x00000000
DDR_CTRL_PHY.DFILPCFG0_REG=\#define DDR_DFILPCFG0 0x07004111
DDR_CTRL_PHY.DFILPCFG1_REG=\#define DDR_DFILPCFG1 0x00000000
DDR_CTRL_PHY.DFIMISC_REG=\#define DDR_DFIMISC 0x00000041
DDR_CTRL_PHY.DFIMODE=3
DDR_CTRL_PHY.DFIPHYMSTR_REG=\#define DDR_DFIPHYMSTR 0x80000000
DDR_CTRL_PHY.DFITMG0_REG=\#define DDR_DFITMG0 0x038f8209
DDR_CTRL_PHY.DFITMG1_REG=\#define DDR_DFITMG1 0x00080303
DDR_CTRL_PHY.DFITMG2_REG=\#define DDR_DFITMG2 0x00000f09
DDR_CTRL_PHY.DFITMG3_REG=\#define DDR_DFITMG3 0x00000000
DDR_CTRL_PHY.DFIUPD0_REG=\#define DDR_DFIUPD0 0xc0300018
DDR_CTRL_PHY.DFIUPD1_REG=\#define DDR_DFIUPD1 0x005700b4
DDR_CTRL_PHY.DFIUPD2_REG=\#define DDR_DFIUPD2 0x80000000
DDR_CTRL_PHY.DIMMCTL_REG=\#define DDR_DIMMCTL 0x00000000
DDR_CTRL_PHY.DRAMTMG0_REG=\#define DDR_DRAMTMG0 0x11152815
DDR_CTRL_PHY.DRAMTMG10_REG=\#define DDR_DRAMTMG10 0x001c180a
DDR_CTRL_PHY.DRAMTMG11_REG=\#define DDR_DRAMTMG11 0x4408021c
DDR_CTRL_PHY.DRAMTMG12_REG=\#define DDR_DRAMTMG12 0x0c020010
DDR_CTRL_PHY.DRAMTMG13_REG=\#define DDR_DRAMTMG13 0x1c200004
DDR_CTRL_PHY.DRAMTMG14_REG=\#define DDR_DRAMTMG14 0x000000a0
DDR_CTRL_PHY.DRAMTMG15_REG=\#define DDR_DRAMTMG15 0x00000000
DDR_CTRL_PHY.DRAMTMG1_REG=\#define DDR_DRAMTMG1 0x0004051e
DDR_CTRL_PHY.DRAMTMG2_REG=\#define DDR_DRAMTMG2 0x0609060d
DDR_CTRL_PHY.DRAMTMG3_REG=\#define DDR_DRAMTMG3 0x0050400c
DDR_CTRL_PHY.DRAMTMG4_REG=\#define DDR_DRAMTMG4 0x0904050a
DDR_CTRL_PHY.DRAMTMG5_REG=\#define DDR_DRAMTMG5 0x06060403
DDR_CTRL_PHY.DRAMTMG6_REG=\#define DDR_DRAMTMG6 0x02020005
DDR_CTRL_PHY.DRAMTMG7_REG=\#define DDR_DRAMTMG7 0x00000202
DDR_CTRL_PHY.DRAMTMG8_REG=\#define DDR_DRAMTMG8 0x03031006
DDR_CTRL_PHY.DRAMTMG9_REG=\#define DDR_DRAMTMG9 0x0002040a
DDR_CTRL_PHY.FREQUENCY_0=1200
DDR_CTRL_PHY.HWLPCTL_REG=\#define DDR_HWLPCTL 0x00000002
DDR_CTRL_PHY.INIT0_REG=\#define DDR_INIT0 0xc0020002
DDR_CTRL_PHY.INIT1_REG=\#define DDR_INIT1 0x00010002
DDR_CTRL_PHY.INIT2_REG=\#define DDR_INIT2 0x00000d00
DDR_CTRL_PHY.INIT3_REG=\#define DDR_INIT3 0x09400103
DDR_CTRL_PHY.INIT4_REG=\#define DDR_INIT4 0x00180000
DDR_CTRL_PHY.INIT5_REG=\#define DDR_INIT5 0x00100004
DDR_CTRL_PHY.INIT6_REG=\#define DDR_INIT6 0x00080460
DDR_CTRL_PHY.INIT7_REG=\#define DDR_INIT7 0x00000c16
DDR_CTRL_PHY.IPParameters=phyvref,VREF (%),READDBIENABLE_0,NUMACTIVEDBYTEDFI0,tRC,FREQUENCY_0,device_width,RTT_NOM,DFIMODE,tDLLK,UIM_MR2_0_REG,DBGCMD_REG,MRCTRL0_REG,UIB_DIMMTYPE_REG,UIS_SWIZZLE_7_REG,DBICTL_REG,HWLPCTL_REG,UIS_SWIZZLE_14_REG,RFSHTMG_REG,ADDRMAP4_REG,UIA_ENABLEHIGHCLKSKEWFIX_REG,SWCTLSTATIC_REG,DERATEEN_REG,ADDRMAP8_REG,UIS_SWIZZLE_18_REG,UIA_CALINTERVAL_REG,SCHED3_REG,UIA_SNPSUMCTLF0RC5X_0_REG,UIM_MR14_0_REG,UIS_SWIZZLE_22_REG,PERFHPR1_REG,UIB_FREQUENCY_0_REG,UIS_SWIZZLE_0_REG,DRAMTMG13_REG,PCFGQOS1_1_REG,DRAMTMG0_REG,PERFLPR1_REG,UIS_SWIZZLE_34_REG,UIS_SWIZZLE_11_REG,ADDRMAP1_REG,SCHED_REG,UIB_NUMDBYTE_REG,DFILPCFG0_REG,UIB_NUMPSTATES_REG,UIA_ODTIMPEDANCE_0_REG,UIA_PHYMSTRMAXREQTOACK_0_REG,UIB_LP4XMODE_REG,UIS_SWIZZLE_37_REG,DFITMG2_REG,DBG1_REG,DRAMTMG7_REG,UIA_CALONCE_REG,RFSHCTL1_REG,UIS_SWIZZLE_30_REG,ADDRMAP10_REG,UIM_MR1_0_REG,UIS_SWIZZLE_4_REG,RFSHTMG1_REG,UIA_LP4NWR_0_REG,UIS_SWIZZLE_26_REG,INIT5_REG,ZQCTL0_REG,PCTRL_1_REG,PCFGQOS0_0_REG,UIA_DISABLEPHYUPDATE_REG,UIA_LP4RXPREAMBLEMODE_0_REG,UIS_SWIZZLE_33_REG,ADDRMAP7_REG,UIS_SWIZZLE_23_REG,CRCPARCTL0_REG,UIA_MEMALERTPUIMP_REG,UIB_DFI1EXISTS_REG,UIA_EXTCALRESVAL_REG,UIB_HARDMACROVER_REG,UIM_MR22_0_REG,DRAMTMG1_REG,UIA_LP4POSTAMBLEEXT_0_REG,ADDRMAP11_REG,UIS_SWIZZLE_8_REG,UIA_LP4DBIWR_0_REG,UIS_SWIZZLE_17_REG,UIA_TXSLEWRISEAC_REG,DRAMTMG12_REG,POISONCFG_REG,UIA_PHYINITSEQUENCENUM_REG,PCFGR_0_REG,UIB_NUMACTIVEDBYTEDFI1_REG,UIA_D4RXPREAMBLELENGTH_0_REG,UIB_DRAMDATAWIDTH_REG,UIA_TXSLEWRISEDQ_0_REG,DBG0_REG,UIA_LP4DBIRD_0_REG,DFITMG3_REG,DFILPCFG1_REG,UIS_SWIZZLE_27_REG,SWCTL_REG,UIS_SWIZZLE_3_REG,DRAMTMG6_REG,PWRCTL_REG,UIA_D4TXPREAMBLELENGTH_0_REG,UIS_SWIZZLE_12_REG,ADDRMAP2_REG,UIB_NUMRANK_DFI0_REG,UIS_SWIZZLE_38_REG,INIT4_REG,ZQCTL1_REG,ADDRMAP6_REG,UIA_MEMALERTVREFLEVEL_REG,UIS_SWIZZLE_16_REG,UIB_TRAIN2D_REG,CRCPARCTL1_REG,INIT7_REG,UIS_SWIZZLE_24_REG,DRAMTMG2_REG,UIB_PLLBYPASS_0_REG,UIM_MR5_0_REG,UIB_READDBIENABLE_0_REG,UIS_SWIZZLE_40_REG,RANKCTL1_REG,PCFGW_1_REG,UIM_MR11_0_REG,UIA_LP4LOWPOWERDRV_REG,UIS_SWIZZLE_32_REG,RANKCTL_REG,RFSHCTL0_REG,DRAMTMG11_REG,SCHED1_REG,PCFGWQOS1_0_REG,MRCTRL2_REG,UIA_ENABLEDFICSPOLARITYFIX_REG,UIS_SWIZZLE_9_REG,INIT0_REG,DRAMTMG9_REG,UIB_DFIFREQRATIO_0_REG,MSTR_REG,INIT3_REG,DRAMTMG14_REG,PWRTMG_REG,PCFGQOS1_0_REG,PCFGWQOS0_0_REG,UIM_MR0_0_REG,DERATEINT_REG,UIB_NUMACTIVEDBYTEDFI0_REG,PCFGR_1_REG,UIS_SWIZZLE_28_REG,UIS_SWIZZLE_2_REG,DIMMCTL_REG,UIA_DRAMBYTESWAP_REG,UIA_PHYMSTRTRAININTERVAL_0_REG,UIS_SWIZZLE_43_REG,UIB_NUMRANK_DFI1_REG,UIA_MEMALERTEN_REG,UIS_SWIZZLE_13_REG,DFIUPD0_REG,ADDRMAP3_REG,UIS_SWIZZLE_39_REG,RFSHCTL3_REG,UIB_DIMODE_REG,DRAMTMG5_REG,ODTCFG_REG,UIB_DRAMTYPE_REG,UIA_MEMALERTSYNCBYPASS_REG,UIA_IS2TTIMING_0_REG,DERATECTL_REG,DFIUPD2_REG,UIS_SWIZZLE_6_REG,DRAMTMG3_REG,UIA_DISABLEUNUSEDADDRLNS_REG,UIS_SWIZZLE_41_REG,UIA_SNPSUMCTLOPT_REG,ODTMAP_REG,PCFGW_0_REG,ADDRMAP5_REG,DFIMISC_REG,ZQCTL2_REG,UIA_TXIMPEDANCE_0_REG,UIS_SWIZZLE_15_REG,UIS_SWIZZLE_31_REG,INIT6_REG,UIA_LP4WLS_0_REG,DRAMTMG10_REG,SCHED4_REG,UIS_SWIZZLE_35_REG,UIA_WDQSEXT_REG,PERFWR1_REG,INIT1_REG,PCFGWQOS1_1_REG,UIA_SEQUENCECTRL_0_REG,UIA_RXENBACKOFF_REG,UIB_NUMANIB_REG,UIM_MR6_0_REG,UIM_MR3_0_REG,UIA_ATXIMPEDANCE_REG,UIA_PHYVREF_REG,PCCFG_REG,DFITMG1_REG,UIS_SWIZZLE_21_REG,MRCTRL1_REG,DRAMTMG8_REG,UIS_SWIZZLE_1_REG,UIS_SWIZZLE_29_REG,UIA_TRAINSEQUENCECTRL_REG,UIM_MR13_0_REG,UIS_SWIZZLE_20_REG,UIA_LP4WL_0_REG,DFITMG0_REG,UIA_LP4RL_0_REG,PCFGWQOS0_1_REG,UIM_MR4_0_REG,UIA_DISDYNADRTRI_0_REG,DRAMTMG15_REG,ADDRMAP0_REG,UIS_SWIZZLE_19_REG,INIT2_REG,UIS_SWIZZLE_10_REG,UIS_SWIZZLE_36_REG,UIA_TXSLEWFALLDQ_0_REG,DFIPHYMSTR_REG,ADDRMAP9_REG,PCFGQOS0_1_REG,PCTRL_0_REG,DFIUPD1_REG,UIA_TXSLEWFALLAC_REG,UIS_SWIZZLE_5_REG,DRAMTMG4_REG,UIS_SWIZZLE_42_REG,UIA_DISABLERETRAINING_REG,UIS_SWIZZLE_25_REG,UIM_MR12_0_REG,A19,A21,A23,A24,A25,A26,A27,A28,A29,A30,A31,memclk,nRTP,WR-RTP,CWL,CL,nWR,tRFC4,tRFC1,tRFC2,A9,A10,A11,A12,A13,A14,A15,A16,A17,A18,A20,A22
DDR_CTRL_PHY.MRCTRL0_REG=\#define DDR_MRCTRL0 0x00000030
DDR_CTRL_PHY.MRCTRL1_REG=\#define DDR_MRCTRL1 0x00000000
DDR_CTRL_PHY.MRCTRL2_REG=\#define DDR_MRCTRL2 0x00000000
DDR_CTRL_PHY.MSTR_REG=\#define DDR_MSTR 0x01041010
DDR_CTRL_PHY.NUMACTIVEDBYTEDFI0=2
DDR_CTRL_PHY.ODTCFG_REG=\#define DDR_ODTCFG 0x06000618
DDR_CTRL_PHY.ODTMAP_REG=\#define DDR_ODTMAP 0x00000001
DDR_CTRL_PHY.PCCFG_REG=\#define DDR_PCCFG 0x00000000
DDR_CTRL_PHY.PCFGQOS0_0_REG=\#define DDR_PCFGQOS0_0 0x0021000c
DDR_CTRL_PHY.PCFGQOS0_1_REG=\#define DDR_PCFGQOS0_1 0x00100007
DDR_CTRL_PHY.PCFGQOS1_0_REG=\#define DDR_PCFGQOS1_0 0x01000080
DDR_CTRL_PHY.PCFGQOS1_1_REG=\#define DDR_PCFGQOS1_1 0x01000080
DDR_CTRL_PHY.PCFGR_0_REG=\#define DDR_PCFGR_0 0x00704100
DDR_CTRL_PHY.PCFGR_1_REG=\#define DDR_PCFGR_1 0x00704100
DDR_CTRL_PHY.PCFGWQOS0_0_REG=\#define DDR_PCFGWQOS0_0 0x01100c07
DDR_CTRL_PHY.PCFGWQOS0_1_REG=\#define DDR_PCFGWQOS0_1 0x01100c07
DDR_CTRL_PHY.PCFGWQOS1_0_REG=\#define DDR_PCFGWQOS1_0 0x04000200
DDR_CTRL_PHY.PCFGWQOS1_1_REG=\#define DDR_PCFGWQOS1_1 0x04000200
DDR_CTRL_PHY.PCFGW_0_REG=\#define DDR_PCFGW_0 0x00004100
DDR_CTRL_PHY.PCFGW_1_REG=\#define DDR_PCFGW_1 0x00004100
DDR_CTRL_PHY.PCTRL_0_REG=\#define DDR_PCTRL_0 0x00000000
DDR_CTRL_PHY.PCTRL_1_REG=\#define DDR_PCTRL_1 0x00000000
DDR_CTRL_PHY.PERFHPR1_REG=\#define DDR_PERFHPR1 0x04000200
DDR_CTRL_PHY.PERFLPR1_REG=\#define DDR_PERFLPR1 0x08000080
DDR_CTRL_PHY.PERFWR1_REG=\#define DDR_PERFWR1 0x08000400
DDR_CTRL_PHY.POISONCFG_REG=\#define DDR_POISONCFG 0x00000000
DDR_CTRL_PHY.PWRCTL_REG=\#define DDR_PWRCTL 0x00000000
DDR_CTRL_PHY.PWRTMG_REG=\#define DDR_PWRTMG 0x00130001
DDR_CTRL_PHY.RANKCTL1_REG=\#define DDR_RANKCTL1 0x0000000d
DDR_CTRL_PHY.RANKCTL_REG=\#define DDR_RANKCTL 0x0000066f
DDR_CTRL_PHY.READDBIENABLE_0=3
DDR_CTRL_PHY.RFSHCTL0_REG=\#define DDR_RFSHCTL0 0x00210010
DDR_CTRL_PHY.RFSHCTL1_REG=\#define DDR_RFSHCTL1 0x00000000
DDR_CTRL_PHY.RFSHCTL3_REG=\#define DDR_RFSHCTL3 0x00000000
DDR_CTRL_PHY.RFSHTMG1_REG=\#define DDR_RFSHTMG1 0x008c0000
DDR_CTRL_PHY.RFSHTMG_REG=\#define DDR_RFSHTMG 0x0092009c
DDR_CTRL_PHY.RTT_NOM=60
DDR_CTRL_PHY.SCHED1_REG=\#define DDR_SCHED1 0x00000000
DDR_CTRL_PHY.SCHED3_REG=\#define DDR_SCHED3 0x04040208
DDR_CTRL_PHY.SCHED4_REG=\#define DDR_SCHED4 0x08400810
DDR_CTRL_PHY.SCHED_REG=\#define DDR_SCHED 0x80001b00
DDR_CTRL_PHY.SWCTLSTATIC_REG=\#define DDR_SWCTLSTATIC 0x00000000
DDR_CTRL_PHY.SWCTL_REG=\#define DDR_SWCTL 0x00000000
DDR_CTRL_PHY.UIA_ATXIMPEDANCE_REG=\#define DDR_UIA_ATXIMPEDANCE 0x00000028
DDR_CTRL_PHY.UIA_CALINTERVAL_REG=\#define DDR_UIA_CALINTERVAL 0x00000009
DDR_CTRL_PHY.UIA_CALONCE_REG=\#define DDR_UIA_CALONCE 0x00000000
DDR_CTRL_PHY.UIA_D4RXPREAMBLELENGTH_0_REG=\#define DDR_UIA_D4RXPREAMBLELENGTH_0 0x00000000
DDR_CTRL_PHY.UIA_D4TXPREAMBLELENGTH_0_REG=\#define DDR_UIA_D4TXPREAMBLELENGTH_0 0x00000000
DDR_CTRL_PHY.UIA_DISABLEPHYUPDATE_REG=\#define DDR_UIA_DISABLEPHYUPDATE 0x00000000
DDR_CTRL_PHY.UIA_DISABLERETRAINING_REG=\#define DDR_UIA_DISABLERETRAINING 0x00000001
DDR_CTRL_PHY.UIA_DISABLEUNUSEDADDRLNS_REG=\#define DDR_UIA_DISABLEUNUSEDADDRLNS 0x00000001
DDR_CTRL_PHY.UIA_DISDYNADRTRI_0_REG=\#define DDR_UIA_DISDYNADRTRI_0 0x00000001
DDR_CTRL_PHY.UIA_DRAMBYTESWAP_REG=\#define DDR_UIA_DRAMBYTESWAP 0x00000000
DDR_CTRL_PHY.UIA_ENABLEDFICSPOLARITYFIX_REG=\#define DDR_UIA_ENABLEDFICSPOLARITYFIX 0x00000000
DDR_CTRL_PHY.UIA_ENABLEHIGHCLKSKEWFIX_REG=\#define DDR_UIA_ENABLEHIGHCLKSKEWFIX 0x00000000
DDR_CTRL_PHY.UIA_EXTCALRESVAL_REG=\#define DDR_UIA_EXTCALRESVAL 0x00000000
DDR_CTRL_PHY.UIA_IS2TTIMING_0_REG=\#define DDR_UIA_IS2TTIMING_0 0x00000000
DDR_CTRL_PHY.UIA_LP4DBIRD_0_REG=\#define DDR_UIA_LP4DBIRD_0 0x00000000
DDR_CTRL_PHY.UIA_LP4DBIWR_0_REG=\#define DDR_UIA_LP4DBIWR_0 0x00000000
DDR_CTRL_PHY.UIA_LP4LOWPOWERDRV_REG=\#define DDR_UIA_LP4LOWPOWERDRV 0x00000000
DDR_CTRL_PHY.UIA_LP4NWR_0_REG=\#define DDR_UIA_LP4NWR_0 0x00000000
DDR_CTRL_PHY.UIA_LP4POSTAMBLEEXT_0_REG=\#define DDR_UIA_LP4POSTAMBLEEXT_0 0x00000000
DDR_CTRL_PHY.UIA_LP4RL_0_REG=\#define DDR_UIA_LP4RL_0 0x00000000
DDR_CTRL_PHY.UIA_LP4RXPREAMBLEMODE_0_REG=\#define DDR_UIA_LP4RXPREAMBLEMODE_0 0x00000000
DDR_CTRL_PHY.UIA_LP4WLS_0_REG=\#define DDR_UIA_LP4WLS_0 0x00000000
DDR_CTRL_PHY.UIA_LP4WL_0_REG=\#define DDR_UIA_LP4WL_0 0x00000000
DDR_CTRL_PHY.UIA_MEMALERTEN_REG=\#define DDR_UIA_MEMALERTEN 0x00000000
DDR_CTRL_PHY.UIA_MEMALERTPUIMP_REG=\#define DDR_UIA_MEMALERTPUIMP 0x00000000
DDR_CTRL_PHY.UIA_MEMALERTSYNCBYPASS_REG=\#define DDR_UIA_MEMALERTSYNCBYPASS 0x00000000
DDR_CTRL_PHY.UIA_MEMALERTVREFLEVEL_REG=\#define DDR_UIA_MEMALERTVREFLEVEL 0x00000000
DDR_CTRL_PHY.UIA_ODTIMPEDANCE_0_REG=\#define DDR_UIA_ODTIMPEDANCE_0 0x00000035
DDR_CTRL_PHY.UIA_PHYINITSEQUENCENUM_REG=\#define DDR_UIA_PHYINITSEQUENCENUM 0x00000000
DDR_CTRL_PHY.UIA_PHYMSTRMAXREQTOACK_0_REG=\#define DDR_UIA_PHYMSTRMAXREQTOACK_0 0x00000000
DDR_CTRL_PHY.UIA_PHYMSTRTRAININTERVAL_0_REG=\#define DDR_UIA_PHYMSTRTRAININTERVAL_0 0x00000000
DDR_CTRL_PHY.UIA_PHYVREF_REG=\#define DDR_UIA_PHYVREF 0x0000005e
DDR_CTRL_PHY.UIA_RXENBACKOFF_REG=\#define DDR_UIA_RXENBACKOFF 0x00000000
DDR_CTRL_PHY.UIA_SEQUENCECTRL_0_REG=\#define DDR_UIA_SEQUENCECTRL_0 0x0000031f
DDR_CTRL_PHY.UIA_SNPSUMCTLF0RC5X_0_REG=\#define DDR_UIA_SNPSUMCTLF0RC5X_0 0x00000000
DDR_CTRL_PHY.UIA_SNPSUMCTLOPT_REG=\#define DDR_UIA_SNPSUMCTLOPT 0x00000000
DDR_CTRL_PHY.UIA_TRAINSEQUENCECTRL_REG=\#define DDR_UIA_TRAINSEQUENCECTRL 0x00000000
DDR_CTRL_PHY.UIA_TXIMPEDANCE_0_REG=\#define DDR_UIA_TXIMPEDANCE_0 0x00000028
DDR_CTRL_PHY.UIA_TXSLEWFALLAC_REG=\#define DDR_UIA_TXSLEWFALLAC 0x0000000f
DDR_CTRL_PHY.UIA_TXSLEWFALLDQ_0_REG=\#define DDR_UIA_TXSLEWFALLDQ_0 0x0000000f
DDR_CTRL_PHY.UIA_TXSLEWRISEAC_REG=\#define DDR_UIA_TXSLEWRISEAC 0x0000000f
DDR_CTRL_PHY.UIA_TXSLEWRISEDQ_0_REG=\#define DDR_UIA_TXSLEWRISEDQ_0 0x0000000f
DDR_CTRL_PHY.UIA_WDQSEXT_REG=\#define DDR_UIA_WDQSEXT 0x00000000
DDR_CTRL_PHY.UIB_DFI1EXISTS_REG=\#define DDR_UIB_DFI1EXISTS 0x00000001
DDR_CTRL_PHY.UIB_DFIFREQRATIO_0_REG=\#define DDR_UIB_DFIFREQRATIO_0 0x00000001
DDR_CTRL_PHY.UIB_DIMMTYPE_REG=\#define DDR_UIB_DIMMTYPE 0x00000004
DDR_CTRL_PHY.UIB_DIMODE_REG=\#define DDR_UIB_DFIMODE 0x00000000
DDR_CTRL_PHY.UIB_DRAMDATAWIDTH_REG=\#define DDR_UIB_DRAMDATAWIDTH 0x00000010
DDR_CTRL_PHY.UIB_DRAMTYPE_REG=\#define DDR_UIB_DRAMTYPE 0x00000000
DDR_CTRL_PHY.UIB_FREQUENCY_0_REG=\#define DDR_UIB_FREQUENCY_0 0x000004b0
DDR_CTRL_PHY.UIB_HARDMACROVER_REG=\#define DDR_UIB_HARDMACROVER 0x00000003
DDR_CTRL_PHY.UIB_LP4XMODE_REG=\#define DDR_UIB_LP4XMODE 0x00000000
DDR_CTRL_PHY.UIB_NUMACTIVEDBYTEDFI0_REG=\#define DDR_UIB_NUMACTIVEDBYTEDFI0 0x00000002
DDR_CTRL_PHY.UIB_NUMACTIVEDBYTEDFI1_REG=\#define DDR_UIB_NUMACTIVEDBYTEDFI1 0x00000000
DDR_CTRL_PHY.UIB_NUMANIB_REG=\#define DDR_UIB_NUMANIB 0x00000008
DDR_CTRL_PHY.UIB_NUMDBYTE_REG=\#define DDR_UIB_NUMDBYTE 0x00000004
DDR_CTRL_PHY.UIB_NUMPSTATES_REG=\#define DDR_UIB_NUMPSTATES 0x00000001
DDR_CTRL_PHY.UIB_NUMRANK_DFI0_REG=\#define DDR_UIB_NUMRANK_DFI0 0x00000001
DDR_CTRL_PHY.UIB_NUMRANK_DFI1_REG=\#define DDR_UIB_NUMRANK_DFI1 0x00000001
DDR_CTRL_PHY.UIB_PLLBYPASS_0_REG=\#define DDR_UIB_PLLBYPASS_0 0x00000000
DDR_CTRL_PHY.UIB_READDBIENABLE_0_REG=\#define DDR_UIB_READDBIENABLE_0 0x00000000
DDR_CTRL_PHY.UIB_TRAIN2D_REG=\#define DDR_UIB_TRAIN2D 0x00000000
DDR_CTRL_PHY.UIM_MR0_0_REG=\#define DDR_UIM_MR0_0 0x00000940
DDR_CTRL_PHY.UIM_MR11_0_REG=\#define DDR_UIM_MR11_0 0x00000000
DDR_CTRL_PHY.UIM_MR12_0_REG=\#define DDR_UIM_MR12_0 0x00000000
DDR_CTRL_PHY.UIM_MR13_0_REG=\#define DDR_UIM_MR13_0 0x00000000
DDR_CTRL_PHY.UIM_MR14_0_REG=\#define DDR_UIM_MR14_0 0x00000000
DDR_CTRL_PHY.UIM_MR1_0_REG=\#define DDR_UIM_MR1_0 0x00000103
DDR_CTRL_PHY.UIM_MR22_0_REG=\#define DDR_UIM_MR22_0 0x00000000
DDR_CTRL_PHY.UIM_MR2_0_REG=\#define DDR_UIM_MR2_0 0x00000018
DDR_CTRL_PHY.UIM_MR3_0_REG=\#define DDR_UIM_MR3_0 0x00000000
DDR_CTRL_PHY.UIM_MR4_0_REG=\#define DDR_UIM_MR4_0 0x00000008
DDR_CTRL_PHY.UIM_MR5_0_REG=\#define DDR_UIM_MR5_0 0x00000460
DDR_CTRL_PHY.UIM_MR6_0_REG=\#define DDR_UIM_MR6_0 0x00000c16
DDR_CTRL_PHY.UIS_SWIZZLE_0_REG=\#define DDR_UIS_SWIZZLE_0 0x0000000c
DDR_CTRL_PHY.UIS_SWIZZLE_10_REG=\#define DDR_UIS_SWIZZLE_10 0x0000000a
DDR_CTRL_PHY.UIS_SWIZZLE_11_REG=\#define DDR_UIS_SWIZZLE_11 0x0000000d
DDR_CTRL_PHY.UIS_SWIZZLE_12_REG=\#define DDR_UIS_SWIZZLE_12 0x00000014
DDR_CTRL_PHY.UIS_SWIZZLE_13_REG=\#define DDR_UIS_SWIZZLE_13 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_14_REG=\#define DDR_UIS_SWIZZLE_14 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_15_REG=\#define DDR_UIS_SWIZZLE_15 0x00000000
