4ms/mp153-devboard/mp257/cubemx/mp257-devboard/mp257-devboard.ioc
DDR_CTRL_PHY.UIS_SWIZZLE_16_REG=\#define DDR_UIS_SWIZZLE_16 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_17_REG=\#define DDR_UIS_SWIZZLE_17 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_18_REG=\#define DDR_UIS_SWIZZLE_18 0x00000006
DDR_CTRL_PHY.UIS_SWIZZLE_19_REG=\#define DDR_UIS_SWIZZLE_19 0x0000000b
DDR_CTRL_PHY.UIS_SWIZZLE_1_REG=\#define DDR_UIS_SWIZZLE_1 0x00000005
DDR_CTRL_PHY.UIS_SWIZZLE_20_REG=\#define DDR_UIS_SWIZZLE_20 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_21_REG=\#define DDR_UIS_SWIZZLE_21 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_22_REG=\#define DDR_UIS_SWIZZLE_22 0x00000011
DDR_CTRL_PHY.UIS_SWIZZLE_23_REG=\#define DDR_UIS_SWIZZLE_23 0x00000008
DDR_CTRL_PHY.UIS_SWIZZLE_24_REG=\#define DDR_UIS_SWIZZLE_24 0x00000002
DDR_CTRL_PHY.UIS_SWIZZLE_25_REG=\#define DDR_UIS_SWIZZLE_25 0x00000018
DDR_CTRL_PHY.UIS_SWIZZLE_26_REG=\#define DDR_UIS_SWIZZLE_26 0x1a13050c
DDR_CTRL_PHY.UIS_SWIZZLE_27_REG=\#define DDR_UIS_SWIZZLE_27 0x19010309
DDR_CTRL_PHY.UIS_SWIZZLE_28_REG=\#define DDR_UIS_SWIZZLE_28 0x0d0a0407
DDR_CTRL_PHY.UIS_SWIZZLE_29_REG=\#define DDR_UIS_SWIZZLE_29 0x00000014
DDR_CTRL_PHY.UIS_SWIZZLE_2_REG=\#define DDR_UIS_SWIZZLE_2 0x00000013
DDR_CTRL_PHY.UIS_SWIZZLE_30_REG=\#define DDR_UIS_SWIZZLE_30 0x000b0600
DDR_CTRL_PHY.UIS_SWIZZLE_31_REG=\#define DDR_UIS_SWIZZLE_31 0x02081100
DDR_CTRL_PHY.UIS_SWIZZLE_32_REG=\#define DDR_UIS_SWIZZLE_32 0x00000018
DDR_CTRL_PHY.UIS_SWIZZLE_33_REG=\#define DDR_UIS_SWIZZLE_33 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_34_REG=\#define DDR_UIS_SWIZZLE_34 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_35_REG=\#define DDR_UIS_SWIZZLE_35 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_36_REG=\#define DDR_UIS_SWIZZLE_36 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_37_REG=\#define DDR_UIS_SWIZZLE_37 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_38_REG=\#define DDR_UIS_SWIZZLE_38 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_39_REG=\#define DDR_UIS_SWIZZLE_39 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_3_REG=\#define DDR_UIS_SWIZZLE_3 0x0000001a
DDR_CTRL_PHY.UIS_SWIZZLE_40_REG=\#define DDR_UIS_SWIZZLE_40 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_41_REG=\#define DDR_UIS_SWIZZLE_41 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_42_REG=\#define DDR_UIS_SWIZZLE_42 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_43_REG=\#define DDR_UIS_SWIZZLE_43 0x00000000
DDR_CTRL_PHY.UIS_SWIZZLE_4_REG=\#define DDR_UIS_SWIZZLE_4 0x00000009
DDR_CTRL_PHY.UIS_SWIZZLE_5_REG=\#define DDR_UIS_SWIZZLE_5 0x00000003
DDR_CTRL_PHY.UIS_SWIZZLE_6_REG=\#define DDR_UIS_SWIZZLE_6 0x00000001
DDR_CTRL_PHY.UIS_SWIZZLE_7_REG=\#define DDR_UIS_SWIZZLE_7 0x00000019
DDR_CTRL_PHY.UIS_SWIZZLE_8_REG=\#define DDR_UIS_SWIZZLE_8 0x00000007
DDR_CTRL_PHY.UIS_SWIZZLE_9_REG=\#define DDR_UIS_SWIZZLE_9 0x00000004
DDR_CTRL_PHY.VREF\ (%)=0.7
DDR_CTRL_PHY.WR-RTP=24
DDR_CTRL_PHY.ZQCTL0_REG=\#define DDR_ZQCTL0 0x01000040
DDR_CTRL_PHY.ZQCTL1_REG=\#define DDR_ZQCTL1 0x2000493e
DDR_CTRL_PHY.ZQCTL2_REG=\#define DDR_ZQCTL2 0x00000000
DDR_CTRL_PHY.device_width=16
DDR_CTRL_PHY.memclk=1200.0
DDR_CTRL_PHY.nRTP=24
DDR_CTRL_PHY.nWR=48
DDR_CTRL_PHY.phyvref=0.7376237623762376
DDR_CTRL_PHY.tDLLK=1024
DDR_CTRL_PHY.tRC=50
DDR_CTRL_PHY.tRFC1=260
DDR_CTRL_PHY.tRFC2=160
DDR_CTRL_PHY.tRFC4=110
DSIHOST_CKN.Mode=DSIHost_Standalone
DSIHOST_CKN.Signal=DSIHOST_CKN
DSIHOST_CKP.Mode=DSIHost_Standalone
DSIHOST_CKP.Signal=DSIHOST_CKP
DSIHOST_D0N.Mode=DSIHost_Standalone
DSIHOST_D0N.Signal=DSIHOST_D0N
DSIHOST_D0P.Mode=DSIHost_Standalone
DSIHOST_D0P.Signal=DSIHOST_D0P
DSIHOST_D1N.Mode=DSIHost_Standalone
DSIHOST_D1N.Signal=DSIHOST_D1N
DSIHOST_D1P.Mode=DSIHost_Standalone
DSIHOST_D1P.Signal=DSIHOST_D1P
DSIHOST_D2N.Mode=DSIHost_Standalone
DSIHOST_D2N.Signal=DSIHOST_D2N
DSIHOST_D2P.Mode=DSIHost_Standalone
DSIHOST_D2P.Signal=DSIHOST_D2P
DSIHOST_D3N.Mode=DSIHost_Standalone
DSIHOST_D3N.Signal=DSIHOST_D3N
DSIHOST_D3P.Mode=DSIHost_Standalone
DSIHOST_D3P.Signal=DSIHOST_D3P
DSIHOST_REXT.Mode=DSIHost_Standalone
DSIHOST_REXT.Signal=DSIHOST_REXT
File.Version=6
GIC.LTDC_IRQn=true\:false\:High level
GIC.RCC_IRQn=true\:false\:High level
GIC.RCC_WAKEUP_IRQn=true\:false\:High level
GPIO.groupedBy=
I2C7.IPParameters=Timing
I2C7.Timing=0x10707DBC
JTCK-SWCLK.GPIOParameters=PinAttribute
JTCK-SWCLK.Mode=JTAG_5_pins
JTCK-SWCLK.PinAttribute=CortexA35SFSBLA
JTCK-SWCLK.Signal=DEBUG_JTCK-SWCLK
JTDI.GPIOParameters=PinAttribute
JTDI.Mode=JTAG_5_pins
JTDI.PinAttribute=CortexA35SFSBLA
JTDI.Signal=DEBUG_JTDI
JTDO-TRACESWO.GPIOParameters=PinAttribute
JTDO-TRACESWO.Mode=JTAG_5_pins
JTDO-TRACESWO.PinAttribute=CortexA35SFSBLA
JTDO-TRACESWO.Signal=DEBUG_JTDO-SWO
JTMS-SWDIO.GPIOParameters=PinAttribute
JTMS-SWDIO.Mode=JTAG_5_pins
JTMS-SWDIO.PinAttribute=CortexA35SFSBLA
JTMS-SWDIO.Signal=DEBUG_JTMS-SWDIO
KeepUserPlacement=true
LVDS1_D0N.GPIOParameters=PinAttribute
LVDS1_D0N.Mode=Single_Link
LVDS1_D0N.PinAttribute=CortexA35SFSBLA
LVDS1_D0N.Signal=LVDS1_D0N
LVDS1_D0P.GPIOParameters=PinAttribute
LVDS1_D0P.Mode=Single_Link
LVDS1_D0P.PinAttribute=CortexA35SFSBLA
LVDS1_D0P.Signal=LVDS1_D0P
LVDS1_D1N.GPIOParameters=PinAttribute
LVDS1_D1N.Mode=Single_Link
LVDS1_D1N.PinAttribute=CortexA35SFSBLA
LVDS1_D1N.Signal=LVDS1_D1N
LVDS1_D1P.GPIOParameters=PinAttribute
LVDS1_D1P.Mode=Single_Link
LVDS1_D1P.PinAttribute=CortexA35SFSBLA
LVDS1_D1P.Signal=LVDS1_D1P
LVDS1_D2N.Mode=Single_Link
LVDS1_D2N.Signal=LVDS1_D2N
LVDS1_D2P.GPIOParameters=PinAttribute
LVDS1_D2P.Mode=Single_Link
LVDS1_D2P.PinAttribute=CortexA35SFSBLA
LVDS1_D2P.Signal=LVDS1_D2P
LVDS1_D3N.GPIOParameters=PinAttribute
LVDS1_D3N.Mode=Single_Link
LVDS1_D3N.PinAttribute=CortexA35SFSBLA
LVDS1_D3N.Signal=LVDS1_D3N
LVDS1_D3P.GPIOParameters=PinAttribute
LVDS1_D3P.Mode=Single_Link
LVDS1_D3P.PinAttribute=CortexA35SFSBLA
LVDS1_D3P.Signal=LVDS1_D3P
LVDS1_D4N.GPIOParameters=PinAttribute
LVDS1_D4N.Mode=Single_Link
LVDS1_D4N.PinAttribute=CortexA35SFSBLA
LVDS1_D4N.Signal=LVDS1_D4N
LVDS1_D4P.GPIOParameters=PinAttribute
LVDS1_D4P.Mode=Single_Link
LVDS1_D4P.PinAttribute=CortexA35SFSBLA
LVDS1_D4P.Signal=LVDS1_D4P
Mcu.CPN=STM32MP257DAK3
Mcu.Context0=BootROMA35
Mcu.Context1=CortexA35SFSBLA
Mcu.Context2=CortexA35SSecureOS
Mcu.Context3=CortexA35NSSSBL
Mcu.Context4=CortexA35NSOS
Mcu.Context5=CortexM33NS
Mcu.ContextNb=6
Mcu.ContextProject=A35TD_TZDIS
Mcu.Family=STM32MP2
Mcu.IP0=ADC1
Mcu.IP1=ADC3
Mcu.IP10=I2C7
Mcu.IP11=ICACHE
Mcu.IP12=LTDC
Mcu.IP13=LVDS
Mcu.IP14=NVIC2
Mcu.IP15=OCTOSPI1
Mcu.IP16=OCTOSPIM
Mcu.IP17=RCC
Mcu.IP18=RIF
Mcu.IP19=SAI1
Mcu.IP2=BSEC
Mcu.IP20=SAI2
Mcu.IP21=SDMMC1
Mcu.IP22=STGEN
Mcu.IP23=SYS
Mcu.IP24=USB3DR
Mcu.IP25=USBH_HS
Mcu.IP3=CORTEX_M33
Mcu.IP4=DCACHE
Mcu.IP5=DDR_CTRL_PHY
Mcu.IP6=DEBUG
Mcu.IP7=DSIHOST
Mcu.IP8=GIC
Mcu.IP9=GPU
Mcu.IPNb=26
Mcu.Name=STM32MP257DAKx
Mcu.Package=VFBGA424
Mcu.Pin0=DSIHOST_D3P
Mcu.Pin1=DSIHOST_D2N
Mcu.Pin10=DSIHOST_D1P
Mcu.Pin100=PH3
Mcu.Pin101=USBH_HS_TXRTUNE
Mcu.Pin102=OSC_OUT
Mcu.Pin103=NJTRST
Mcu.Pin104=PC7
Mcu.Pin105=PF3
Mcu.Pin106=PH10
Mcu.Pin107=PA9
Mcu.Pin108=USBH_HS_DP
Mcu.Pin109=USB3DR_DP
Mcu.Pin11=PB0
Mcu.Pin110=USB3DR_TXRTUNE
Mcu.Pin111=OSC_IN
Mcu.Pin112=PG2
Mcu.Pin113=PC8
Mcu.Pin114=PC10
Mcu.Pin115=PH5
Mcu.Pin116=USBH_HS_DM
Mcu.Pin117=USB3DR_DM
Mcu.Pin118=VP_BSEC_VS_BSEC
Mcu.Pin119=VP_CORTEX_M33_VS_CORTEX_M33
Mcu.Pin12=PB4
Mcu.Pin120=VP_DCACHE_VS_DCACHE
Mcu.Pin121=VP_DDR_CTRL_PHY_DDR4
Mcu.Pin122=VP_DDR_CTRL_PHY_VS_16BITS
Mcu.Pin123=VP_DDR_CTRL_PHY_VS_4Gb
Mcu.Pin124=VP_GPU_VS_GPU
Mcu.Pin125=VP_ICACHE_VS_ICACHE
Mcu.Pin126=VP_OCTOSPI1_VS_FlashMemoryPageSizeSig
Mcu.Pin127=VP_OCTOSPI1_VS_FlashMemoryTypeSig
Mcu.Pin128=VP_OCTOSPI1_VS_quad
Mcu.Pin129=VP_OCTOSPIM_VS_IO
Mcu.Pin13=PD0
Mcu.Pin130=VP_RIF_VS_RIF1
Mcu.Pin131=VP_SAI1_VP_$IpInstance_SAIA_SAI_BASIC
Mcu.Pin132=VP_STGEN_VS_STGEN
Mcu.Pin133=VP_SYS_VS_Systick
Mcu.Pin14=PD5
Mcu.Pin15=PE0
Mcu.Pin16=PE4
Mcu.Pin17=PE11
Mcu.Pin18=PE14
Mcu.Pin19=DSIHOST_CKP
Mcu.Pin2=DSIHOST_D1N
Mcu.Pin20=DSIHOST_CKN
Mcu.Pin21=DSIHOST_D0N
Mcu.Pin22=PB5
Mcu.Pin23=PD4
Mcu.Pin24=PE1
Mcu.Pin25=PE2
Mcu.Pin26=PE3
Mcu.Pin27=PE5
Mcu.Pin28=PE13
Mcu.Pin29=PE12
Mcu.Pin3=PB2
Mcu.Pin30=DSIHOST_REXT
Mcu.Pin31=PD2
Mcu.Pin32=PD7
Mcu.Pin33=PE15
Mcu.Pin34=PD13
Mcu.Pin35=PD15
Mcu.Pin36=PD14
Mcu.Pin37=LVDS1_D0P
Mcu.Pin38=LVDS1_D0N
Mcu.Pin39=PD3
Mcu.Pin4=PD6
Mcu.Pin40=LVDS1_D1P
Mcu.Pin41=LVDS1_D1N
Mcu.Pin42=LVDS1_D2P
Mcu.Pin43=LVDS1_D2N
Mcu.Pin44=PI6
Mcu.Pin45=PI7
Mcu.Pin46=LVDS1_D4P
Mcu.Pin47=LVDS1_D4N
Mcu.Pin48=PI5
Mcu.Pin49=PG15
Mcu.Pin5=PE9
Mcu.Pin50=LVDS1_D3P
Mcu.Pin51=LVDS1_D3N
Mcu.Pin52=PG8
Mcu.Pin53=PI0
Mcu.Pin54=PG9
Mcu.Pin55=PG10
Mcu.Pin56=PI1
Mcu.Pin57=PG14
Mcu.Pin58=PG11
Mcu.Pin59=PG12
Mcu.Pin6=PB13
Mcu.Pin60=PI2
Mcu.Pin61=PI3
Mcu.Pin62=PG13
Mcu.Pin63=PF13
Mcu.Pin64=PF14
Mcu.Pin65=PF12
Mcu.Pin66=PI4
Mcu.Pin67=PF15
Mcu.Pin68=PG5
Mcu.Pin69=PG6
Mcu.Pin7=DSIHOST_D3N
Mcu.Pin70=PI9
Mcu.Pin71=PG7
Mcu.Pin72=JTCK-SWCLK
Mcu.Pin73=PG3
Mcu.Pin74=PC3
Mcu.Pin75=PF5
Mcu.Pin76=PH9
Mcu.Pin77=PF0
Mcu.Pin78=PF7
Mcu.Pin79=PC6
Mcu.Pin8=DSIHOST_D2P
Mcu.Pin80=PH4
Mcu.Pin81=JTDO-TRACESWO
Mcu.Pin82=PC4
Mcu.Pin83=PA12
Mcu.Pin84=PF2
Mcu.Pin85=PG1
Mcu.Pin86=PG4
Mcu.Pin87=PC11
Mcu.Pin88=PC5
Mcu.Pin89=JTMS-SWDIO
Mcu.Pin9=DSIHOST_D0P
Mcu.Pin90=JTDI
Mcu.Pin91=PF11
Mcu.Pin92=PF10
Mcu.Pin93=PB15
Mcu.Pin94=PC12
Mcu.Pin95=PF9
Mcu.Pin96=PC9
Mcu.Pin97=PF8
Mcu.Pin98=PH7
Mcu.Pin99=PA5
Mcu.PinsNb=134
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP257DAKx
MxCube.Version=6.17.0
MxDb.Version=DB.6.0.170
NJTRST.GPIOParameters=PinAttribute
NJTRST.Mode=JTAG_5_pins
NJTRST.PinAttribute=CortexA35SFSBLA
NJTRST.Signal=DEBUG_JTRST
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.ForceEnableDMAVector=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.RCC_WAKEUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
OSC_IN.Mode=HSE-External-Oscillator
OSC_IN.Signal=RCC_OSC_IN
OSC_OUT.Mode=HSE-External-Oscillator
OSC_OUT.Signal=RCC_OSC_OUT
PA12.Locked=true
PA12.Signal=SPI6_MOSI
PA5.GPIOParameters=PinAttribute
PA5.Locked=true
PA5.Mode=SAI_B_Master
PA5.PinAttribute=CortexA35SFSBLA
PA5.Signal=SAI2_SD_B
PA9.GPIOParameters=PinAttribute
PA9.Locked=true
PA9.Mode=SAI_B_Master
PA9.PinAttribute=CortexA35SFSBLA
PA9.Signal=SAI2_SCK_B
PB0.Locked=true
PB0.Signal=SPI2_SCK
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.Mode=SAI_B_SyncSlave
PB13.PinAttribute=CortexA35SFSBLA
PB13.Signal=SAI1_SD_B
PB15.GPIOParameters=PinAttribute
PB15.Mode=IN15-Single-Ended
PB15.PinAttribute=CortexA35SFSBLA
PB15.Signal=ADC1_INP15
PB2.Locked=true
PB2.Signal=SPI2_MOSI
PB4.Locked=true
PB4.Signal=I2C2_SDA
PB5.Locked=true
PB5.Signal=I2C2_SCL
PC10.GPIOParameters=PinAttribute
PC10.Mode=IN5-Single-Ended
PC10.PinAttribute=CortexA35SFSBLA
PC10.Signal=ADC1_INP5
PC11.GPIOParameters=PinAttribute
PC11.Mode=IN7-Single-Ended
PC11.PinAttribute=CortexA35SFSBLA
PC11.Signal=ADC1_INP7
PC12.GPIOParameters=PinAttribute
PC12.Mode=IN17-Single-Ended
PC12.PinAttribute=CortexA35SFSBLA
PC12.Signal=ADC1_INP17
PC3.GPIOParameters=PinAttribute
PC3.Mode=IN12-Single-Ended
PC3.PinAttribute=CortexA35SFSBLA
PC3.Signal=ADC1_INP12
PC4.Locked=true
PC4.Signal=SPI6_MISO
PC5.GPIOParameters=PinAttribute
PC5.Mode=IN10-Single-Ended
PC5.PinAttribute=CortexA35SFSBLA
PC5.Signal=ADC1_INP10
PC6.GPIOParameters=PinAttribute
PC6.Mode=IN9-Single-Ended
PC6.PinAttribute=CortexA35SFSBLA
PC6.Signal=ADC1_INP9
PC7.GPIOParameters=PinAttribute
PC7.Mode=IN9-Single-Ended
PC7.PinAttribute=CortexA35SFSBLA
PC7.Signal=ADC3_INP9
PC8.Locked=true
PC8.Signal=SPI6_NSS
PC9.GPIOParameters=PinAttribute
PC9.Mode=IN8-Single-Ended
PC9.PinAttribute=CortexA35SFSBLA
PC9.Signal=ADC1_INP8
PD0.GPIOParameters=PinAttribute
PD0.Mode=OCTOSPI1_Port1Quad
PD0.PinAttribute=BootROMA35
PD0.Signal=OCTOSPIM_P1_CLK
PD13.GPIOParameters=PinAttribute
PD13.Locked=true
PD13.PinAttribute=Free
PD13.Signal=GPIO_Input
PD14.GPIOParameters=PinAttribute
PD14.Mode=I2C
PD14.PinAttribute=CortexA35SFSBLA
PD14.Signal=I2C7_SDA
PD15.GPIOParameters=PinAttribute
PD15.Mode=I2C
PD15.PinAttribute=CortexA35SFSBLA
PD15.Signal=I2C7_SCL
PD2.Locked=true
PD2.Signal=SPI1_NSS
PD3.GPIOParameters=PinAttribute
PD3.Mode=OCTOSPI1_Port1_NCS1
PD3.PinAttribute=BootROMA35
PD3.Signal=OCTOSPIM_P1_NCS1
PD4.GPIOParameters=PinAttribute
PD4.Mode=OCTOSPI1_Port1Quad
PD4.PinAttribute=BootROMA35
PD4.Signal=OCTOSPIM_P1_IO0
PD5.GPIOParameters=PinAttribute
PD5.Mode=OCTOSPI1_Port1Quad
PD5.PinAttribute=BootROMA35
PD5.Signal=OCTOSPIM_P1_IO1
PD6.GPIOParameters=PinAttribute
PD6.Mode=OCTOSPI1_Port1Quad
PD6.PinAttribute=BootROMA35
PD6.Signal=OCTOSPIM_P1_IO2
PD7.GPIOParameters=PinAttribute
PD7.Mode=OCTOSPI1_Port1Quad
PD7.PinAttribute=BootROMA35
PD7.Signal=OCTOSPIM_P1_IO3
PE0.GPIOParameters=PinAttribute
PE0.Mode=SD_4_bits_Wide_bus
PE0.PinAttribute=BootROMA35,CortexA35SFSBLA
PE0.Signal=SDMMC1_D2
PE1.GPIOParameters=PinAttribute
PE1.Mode=SD_4_bits_Wide_bus
PE1.PinAttribute=BootROMA35,CortexA35SFSBLA
PE1.Signal=SDMMC1_D3
PE11.GPIOParameters=PinAttribute
PE11.Locked=true
PE11.Mode=SAI_A_MasterWithClock
PE11.PinAttribute=CortexA35SFSBLA
PE11.Signal=SAI1_FS_A
PE12.GPIOParameters=PinAttribute
PE12.Locked=true
PE12.PinAttribute=Free
PE12.Signal=GPIO_Output
PE13.GPIOParameters=PinAttribute
PE13.Locked=true
PE13.Mode=SAI_A_MasterWithClock
PE13.PinAttribute=CortexA35SFSBLA
PE13.Signal=SAI1_SD_A
PE14.GPIOParameters=PinAttribute
PE14.Locked=true
PE14.Mode=SAI_A_MasterWithClock
PE14.PinAttribute=CortexA35SFSBLA
PE14.Signal=SAI1_MCLK_A
PE15.GPIOParameters=PinAttribute
PE15.Locked=true
PE15.Mode=SAI_A_MasterWithClock
PE15.PinAttribute=CortexA35SFSBLA
PE15.Signal=SAI1_SCK_A
PE2.GPIOParameters=PinAttribute
PE2.Mode=SD_4_bits_Wide_bus
PE2.PinAttribute=BootROMA35,CortexA35SFSBLA
PE2.Signal=SDMMC1_CMD
PE3.GPIOParameters=PinAttribute
PE3.Mode=SD_4_bits_Wide_bus
PE3.PinAttribute=BootROMA35,CortexA35SFSBLA
PE3.Signal=SDMMC1_CK
PE4.GPIOParameters=PinAttribute
PE4.Mode=SD_4_bits_Wide_bus
PE4.PinAttribute=BootROMA35,CortexA35SFSBLA
PE4.Signal=SDMMC1_D0
PE5.GPIOParameters=PinAttribute
PE5.Mode=SD_4_bits_Wide_bus
PE5.PinAttribute=BootROMA35,CortexA35SFSBLA
PE5.Signal=SDMMC1_D1
PE9.GPIOParameters=PinAttribute
PE9.Locked=true
PE9.PinAttribute=Free
PE9.Signal=GPIO_Input
PF0.GPIOParameters=PinAttribute
PF0.Mode=IN11-Single-Ended
PF0.PinAttribute=CortexA35SFSBLA
PF0.Signal=ADC1_INP11
PF10.GPIOParameters=PinAttribute
PF10.Mode=IN2-Single-Ended
PF10.PinAttribute=CortexA35SFSBLA
PF10.Signal=ADC3_INP2
PF11.GPIOParameters=PinAttribute
PF11.Mode=IN6-Single-Ended
PF11.PinAttribute=CortexA35SFSBLA
PF11.Signal=ADC3_INP6
PF12.GPIOParameters=PinAttribute
PF12.Mode=RGB888
PF12.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF12.Signal=LTDC_CLK
PF13.GPIOParameters=PinAttribute
PF13.Mode=RGB888
PF13.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF13.Signal=LTDC_R2
PF14.GPIOParameters=PinAttribute
PF14.Mode=RGB888
PF14.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF14.Signal=LTDC_R3
PF15.GPIOParameters=PinAttribute
PF15.Mode=RGB888
PF15.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF15.Signal=LTDC_R4
PF2.GPIOParameters=PinAttribute
PF2.Mode=IN13-Single-Ended
PF2.PinAttribute=CortexA35SFSBLA
PF2.Signal=ADC1_INP13
PF3.GPIOParameters=PinAttribute
PF3.Mode=IN16-Single-Ended
PF3.PinAttribute=CortexA35SFSBLA
PF3.Signal=ADC1_INP16
PF5.Locked=true
PF5.Signal=SPI6_SCK
PF7.GPIOParameters=PinAttribute
PF7.Mode=RGB888
PF7.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF7.Signal=LTDC_R1
PF8.GPIOParameters=PinAttribute
PF8.Mode=RGB888
PF8.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PF8.Signal=LTDC_G0
PF9.GPIOParameters=PinAttribute
PF9.Locked=true
PF9.Mode=SAI_A_SyncSlave
PF9.PinAttribute=CortexA35SFSBLA
PF9.Signal=SAI2_SD_A
PG1.GPIOParameters=PinAttribute
PG1.Mode=IN6-Single-Ended
PG1.PinAttribute=CortexA35SFSBLA
PG1.Signal=ADC1_INP6
PG10.GPIOParameters=PinAttribute
PG10.Mode=RGB888
PG10.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG10.Signal=LTDC_G4
PG11.GPIOParameters=PinAttribute
PG11.Mode=RGB888
PG11.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG11.Signal=LTDC_G5
PG12.GPIOParameters=PinAttribute
PG12.Mode=RGB888
PG12.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG12.Signal=LTDC_G6
PG13.GPIOParameters=PinAttribute
PG13.Mode=RGB888
PG13.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG13.Signal=LTDC_G7
PG14.GPIOParameters=PinAttribute
PG14.Mode=RGB888
PG14.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG14.Signal=LTDC_B1
PG15.GPIOParameters=PinAttribute
PG15.Mode=RGB888
PG15.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG15.Signal=LTDC_B2
PG2.GPIOParameters=PinAttribute
PG2.Mode=IN2-Single-Ended
PG2.PinAttribute=CortexA35SFSBLA
PG2.Signal=ADC1_INP2
PG3.GPIOParameters=PinAttribute
PG3.Locked=true
PG3.PinAttribute=CortexA35SFSBLA
PG3.Signal=SharedStack_PG3
PG3.Stacked=true
PG4.GPIOParameters=PinAttribute
PG4.Mode=IN4-Single-Ended
PG4.PinAttribute=CortexA35SFSBLA
PG4.Signal=ADC1_INP4
PG5.GPIOParameters=PinAttribute
PG5.Mode=RGB888
PG5.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG5.Signal=LTDC_R5
PG6.GPIOParameters=PinAttribute
PG6.Mode=RGB888
PG6.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG6.Signal=LTDC_R6
PG7.GPIOParameters=PinAttribute
PG7.Mode=RGB888
PG7.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG7.Signal=LTDC_R7
PG8.GPIOParameters=PinAttribute
PG8.Mode=RGB888
PG8.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG8.Signal=LTDC_G2
PG9.GPIOParameters=PinAttribute
PG9.Mode=RGB888
PG9.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PG9.Signal=LTDC_G3
PH10.GPIOParameters=PinAttribute
PH10.Mode=IN8-Single-Ended
PH10.PinAttribute=CortexA35SFSBLA
PH10.Signal=ADC3_INP8
PH3.GPIOParameters=PinAttribute
PH3.Locked=true
PH3.PinAttribute=Free
PH3.Signal=GPIO_Input
PH4.GPIOParameters=PinAttribute
PH4.Mode=RGB888
PH4.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PH4.Signal=LTDC_R0
PH5.GPIOParameters=PinAttribute
PH5.Mode=RGB888
