4ms/mp153-devboard/mp257/cubemx/mp257-devboard/mp257-devboard.ioc
PH5.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PH5.Signal=LTDC_G1
PH7.GPIOParameters=PinAttribute
PH7.Locked=true
PH7.PinAttribute=CortexA35SFSBLA
PH7.Signal=UART4_TX
PH9.GPIOParameters=PinAttribute
PH9.Mode=IN4-Single-Ended
PH9.PinAttribute=CortexA35SFSBLA
PH9.Signal=ADC3_INP4
PI0.GPIOParameters=PinAttribute
PI0.Mode=RGB888
PI0.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI0.Signal=LTDC_B3
PI1.GPIOParameters=PinAttribute
PI1.Mode=RGB888
PI1.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI1.Signal=LTDC_B4
PI2.GPIOParameters=PinAttribute
PI2.Mode=RGB888
PI2.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI2.Signal=LTDC_B5
PI3.GPIOParameters=PinAttribute
PI3.Mode=RGB888
PI3.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI3.Signal=LTDC_B6
PI4.GPIOParameters=PinAttribute
PI4.Mode=RGB888
PI4.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI4.Signal=LTDC_B7
PI5.GPIOParameters=PinAttribute
PI5.Mode=RGB888
PI5.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI5.Signal=LTDC_DE
PI6.GPIOParameters=PinAttribute
PI6.Mode=RGB888
PI6.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI6.Signal=LTDC_VSYNC
PI7.GPIOParameters=PinAttribute
PI7.Mode=RGB888
PI7.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI7.Signal=LTDC_HSYNC
PI9.GPIOParameters=PinAttribute
PI9.Mode=RGB888
PI9.PinAttribute=CortexA35NSSSBL,CortexA35NSOS
PI9.Signal=LTDC_B0
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=-90
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerLinker=GCC
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=../../../../../stm32/STM32CubeMP2
ProjectManager.DefaultFWLocation=false
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32MP257DAKx
ProjectManager.DeviceTreeLocation=
ProjectManager.DeviceTreeLocationCortexM=
ProjectManager.FirmwarePackage=STM32Cube FW_MP2 V1.3.0
ProjectManager.FreePins=false
ProjectManager.FreePinsContext=
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=mp257-devboard.ioc
ProjectManager.ProjectName=mp257-devboard
ProjectManager.ProjectStructure=
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=CMake
ProjectManager.ToolChainLocation=
ProjectManager.UAScriptAfterPath=
ProjectManager.UAScriptBeforePath=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false,2-MX_GPIO_Init-GPIO-false-HAL-true
RCC.ADC12Freq_Value=64000000
RCC.ADC3Freq_Value=114285714.28571428
RCC.AHB1234Freq_Value=200000000
RCC.APB1Freq_Value=200000000
RCC.APB2Freq_Value=200000000
RCC.APB3Freq_Value=200000000
RCC.APB4Freq_Value=200000000
RCC.APBDBGFreq_Value=200000000
RCC.D3PERFreq_Value=16000000
RCC.DSIBLANEFreq_Value=40000000
RCC.DSIPHYFreq_Value=40000000
RCC.DTSFreq_Value=16000000
RCC.FBDIV1=40
RCC.FBDIV2=30
RCC.FBDIV4=30
RCC.FBDIV5=30
RCC.FBDIV7=29
RCC.FOUTPOSTDIV1Freq_Value=1600000000
RCC.FOUTPOSTDIV2Freq_Value=600000000
RCC.FOUTPOSTDIV3Freq_Value=500000000
RCC.FOUTPOSTDIV4Freq_Value=1200000000
RCC.FOUTPOSTDIV5Freq_Value=1200000000
RCC.FOUTPOSTDIV6Freq_Value=1600000000
RCC.FOUTPOSTDIV7Freq_Value=580000000
RCC.FOUTPOSTDIV8Freq_Value=1600000000
RCC.FamilyName=M
RCC.HSE_VALUE=40000000
RCC.HSI_VALUE=64000000
RCC.IPParameters=ADC12Freq_Value,ADC3Freq_Value,AHB1234Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,APBDBGFreq_Value,D3PERFreq_Value,DSIBLANEFreq_Value,DSIPHYFreq_Value,DTSFreq_Value,FBDIV1,FBDIV2,FBDIV4,FBDIV5,FBDIV7,FOUTPOSTDIV1Freq_Value,FOUTPOSTDIV2Freq_Value,FOUTPOSTDIV3Freq_Value,FOUTPOSTDIV4Freq_Value,FOUTPOSTDIV5Freq_Value,FOUTPOSTDIV6Freq_Value,FOUTPOSTDIV7Freq_Value,FOUTPOSTDIV8Freq_Value,FamilyName,HSE_VALUE,HSI_VALUE,LSE_VALUE,LSI_VALUE,LVDSFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,MCUCLKFreq_VALUE,MCUClockFreq_Value,MCUDIVCLKFreq_Value,MCU_Div,MSI_VALUE,Obs0Freq_Value,Obs1Freq_Value,PLL1Source,PLL2FRACV,PLL2Source,PLL3Source,PLL4Source,PLL5Source,PLL7Source,POSTDIV1_3,POSTDIV2_2,POSTDIV2_7,ROOT0Freq_VALUE,ROOT10Freq_VALUE,ROOT11Freq_VALUE,ROOT12Freq_VALUE,ROOT13Freq_VALUE,ROOT14Freq_VALUE,ROOT15Freq_VALUE,ROOT16Freq_VALUE,ROOT17Freq_VALUE,ROOT18Freq_VALUE,ROOT19Freq_VALUE,ROOT1Freq_VALUE,ROOT20Freq_VALUE,ROOT21Freq_VALUE,ROOT22Freq_VALUE,ROOT23Freq_VALUE,ROOT24Freq_VALUE,ROOT25Freq_VALUE,ROOT26Freq_VALUE,ROOT27Freq_VALUE,ROOT28Freq_VALUE,ROOT29Freq_VALUE,ROOT2Freq_VALUE,ROOT30Freq_VALUE,ROOT31Freq_VALUE,ROOT32Freq_VALUE,ROOT34Freq_VALUE,ROOT36Freq_VALUE,ROOT37Freq_VALUE,ROOT38Freq_VALUE,ROOT39Freq_VALUE,ROOT3Freq_VALUE,ROOT40Freq_VALUE,ROOT41Freq_VALUE,ROOT42Freq_VALUE,ROOT44Freq_VALUE,ROOT45Freq_VALUE,ROOT46Freq_VALUE,ROOT47Freq_VALUE,ROOT48Freq_VALUE,ROOT49Freq_VALUE,ROOT4Freq_VALUE,ROOT50Freq_VALUE,ROOT51Freq_VALUE,ROOT52Freq_VALUE,ROOT53Freq_VALUE,ROOT54Freq_VALUE,ROOT55Freq_VALUE,ROOT56Freq_VALUE,ROOT57Freq_VALUE,ROOT58Freq_VALUE,ROOT59Freq_VALUE,ROOT5Freq_VALUE,ROOT60Freq_VALUE,ROOT61Freq_VALUE,ROOT62Freq_VALUE,ROOT63Freq_VALUE,ROOT6Freq_VALUE,ROOT7Freq_VALUE,ROOT8Freq_VALUE,ROOT9Freq_VALUE,RTCCLockSelection,RTCFreq_Value,SPDIFFreq_Value,Tim1OutputFreq_Value,Tim2OutputFreq_Value,USB2PHY1Freq_Value,USB2PHY2Freq_Value,USB3PCIPHYFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCO4OutputFreq_Value,VCO5OutputFreq_Value,VCO6OutputFreq_Value,VCO7OutputFreq_Value,VCO8OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInput4Freq_Value,VCOInput5Freq_Value,VCOInput6Freq_Value,VCOInput7Freq_Value,VCOInput8Freq_Value,XBAR0CLKSource,XBAR0Findiv,XBAR1CLKSource,XBAR1Findiv,XBAR1Prediv,XBAR23CLKSource,XBAR23Findiv,XBAR23Prediv,XBAR27Findiv,XBAR27Prediv,XBAR2CLKSource,XBAR2Findiv,XBAR34CLKSource,XBAR34Findiv,XBAR34Prediv,XBAR3CLKSource,XBAR3Findiv,XBAR3Prediv,XBAR47CLKSource,XBAR47Findiv,XBAR47Prediv,XBAR48Findiv,XBAR48Prediv,XBAR57CLKSource,XBAR57Findiv,XBAR57Prediv,XBAR58CLKSource,XBAR58Findiv,XBAR58Prediv,XBAR59Findiv,XBAR63CLKSource,XBAR63Findiv
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.LVDSFreq_Value=40000000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=64000000
RCC.MCUCLKFreq_VALUE=400000000
RCC.MCUClockFreq_Value=400000000
RCC.MCUDIVCLKFreq_Value=200000000
RCC.MCU_Div=RCC_MCU_DIV2
RCC.MSI_VALUE=16000000
RCC.Obs0Freq_Value=16000000
RCC.Obs1Freq_Value=16000000
RCC.PLL1Source=RCC_PLL1SOURCE_HSE
RCC.PLL2FRACV=0
RCC.PLL2Source=RCC_PLL2SOURCE_HSE
RCC.PLL3Source=RCC_PLL3SOURCE_HSE
RCC.PLL4Source=RCC_PLL4SOURCE_HSE
RCC.PLL5Source=RCC_PLL5SOURCE_HSE
RCC.PLL7Source=RCC_PLL7SOURCE_HSE
RCC.POSTDIV1_3=2
RCC.POSTDIV2_2=2
RCC.POSTDIV2_7=2
RCC.ROOT0Freq_VALUE=400000000
RCC.ROOT10Freq_VALUE=64000000
RCC.ROOT11Freq_VALUE=64000000
RCC.ROOT12Freq_VALUE=64000000
RCC.ROOT13Freq_VALUE=64000000
RCC.ROOT14Freq_VALUE=64000000
RCC.ROOT15Freq_VALUE=64000000
RCC.ROOT16Freq_VALUE=64000000
RCC.ROOT17Freq_VALUE=64000000
RCC.ROOT18Freq_VALUE=64000000
RCC.ROOT19Freq_VALUE=64000000
RCC.ROOT1Freq_VALUE=150000000
RCC.ROOT20Freq_VALUE=64000000
RCC.ROOT21Freq_VALUE=64000000
RCC.ROOT22Freq_VALUE=64000000
RCC.ROOT23Freq_VALUE=72500000
RCC.ROOT24Freq_VALUE=64000000
RCC.ROOT25Freq_VALUE=64000000
RCC.ROOT26Freq_VALUE=40000000
RCC.ROOT27Freq_VALUE=200000000
RCC.ROOT28Freq_VALUE=40000000
RCC.ROOT29Freq_VALUE=1600000000
RCC.ROOT2Freq_VALUE=600000000
RCC.ROOT30Freq_VALUE=40000000
RCC.ROOT31Freq_VALUE=40000000
RCC.ROOT32Freq_VALUE=40000000
RCC.ROOT34Freq_VALUE=20000000
RCC.ROOT36Freq_VALUE=16000000
RCC.ROOT37Freq_VALUE=64000000
RCC.ROOT38Freq_VALUE=64000000
RCC.ROOT39Freq_VALUE=64000000
RCC.ROOT3Freq_VALUE=300000000
RCC.ROOT40Freq_VALUE=32000
RCC.ROOT41Freq_VALUE=32000
RCC.ROOT42Freq_VALUE=64000000
RCC.ROOT44Freq_VALUE=64000000
RCC.ROOT45Freq_VALUE=64000000
RCC.ROOT46Freq_VALUE=64000000
RCC.ROOT47Freq_VALUE=114285714.28571428
RCC.ROOT48Freq_VALUE=133333333.33333333
RCC.ROOT49Freq_VALUE=1600000000
RCC.ROOT4Freq_VALUE=64000000
RCC.ROOT50Freq_VALUE=1600000000
RCC.ROOT51Freq_VALUE=64000000
RCC.ROOT52Freq_VALUE=64000000
RCC.ROOT53Freq_VALUE=64000000
RCC.ROOT54Freq_VALUE=1600000000
RCC.ROOT55Freq_VALUE=1600000000
RCC.ROOT56Freq_VALUE=64000000
RCC.ROOT57Freq_VALUE=20000000
RCC.ROOT58Freq_VALUE=20000000
RCC.ROOT59Freq_VALUE=533333333.3333333
RCC.ROOT5Freq_VALUE=64000000
RCC.ROOT60Freq_VALUE=1600000000
RCC.ROOT61Freq_VALUE=64000000
RCC.ROOT62Freq_VALUE=64000000
RCC.ROOT63Freq_VALUE=400000000
RCC.ROOT6Freq_VALUE=64000000
RCC.ROOT7Freq_VALUE=32000
RCC.ROOT8Freq_VALUE=64000000
RCC.ROOT9Freq_VALUE=64000000
RCC.RTCCLockSelection=RCC_RTCCLKSOURCE_LSI
RCC.RTCFreq_Value=32000
RCC.SPDIFFreq_Value=12288000
RCC.Tim1OutputFreq_Value=200000000
RCC.Tim2OutputFreq_Value=200000000
RCC.USB2PHY1Freq_Value=20000000
RCC.USB2PHY2Freq_Value=20000000
RCC.USB3PCIPHYFreq_Value=20000000
RCC.VCO1OutputFreq_Value=1600000000
RCC.VCO2OutputFreq_Value=1200000000
RCC.VCO3OutputFreq_Value=1000000000
RCC.VCO4OutputFreq_Value=1200000000
RCC.VCO5OutputFreq_Value=1200000000
RCC.VCO6OutputFreq_Value=1600000000
RCC.VCO7OutputFreq_Value=1160000000
RCC.VCO8OutputFreq_Value=1600000000
RCC.VCOInput1Freq_Value=40000000
RCC.VCOInput2Freq_Value=40000000
RCC.VCOInput3Freq_Value=40000000
RCC.VCOInput4Freq_Value=40000000
RCC.VCOInput5Freq_Value=40000000
RCC.VCOInput6Freq_Value=64000000
RCC.VCOInput7Freq_Value=40000000
RCC.VCOInput8Freq_Value=64000000
RCC.XBAR0CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR0Findiv=3
RCC.XBAR1CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR1Findiv=2
RCC.XBAR1Prediv=4
RCC.XBAR23CLKSource=RCC_XBAR_CLKSRC_PLL7
RCC.XBAR23Findiv=4
RCC.XBAR23Prediv=2
RCC.XBAR27Findiv=4
RCC.XBAR27Prediv=2
RCC.XBAR2CLKSource=RCC_XBAR_CLKSRC_PLL5
RCC.XBAR2Findiv=2
RCC.XBAR34CLKSource=RCC_XBAR_CLKSRC_PLL5
RCC.XBAR34Findiv=30
RCC.XBAR34Prediv=2
RCC.XBAR3CLKSource=RCC_XBAR_CLKSRC_PLL5
RCC.XBAR3Findiv=2
RCC.XBAR3Prediv=2
RCC.XBAR47CLKSource=RCC_XBAR_CLKSRC_PLL6
RCC.XBAR47Findiv=7
RCC.XBAR47Prediv=2
RCC.XBAR48Findiv=6
RCC.XBAR48Prediv=2
RCC.XBAR57CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR57Findiv=30
RCC.XBAR57Prediv=2
RCC.XBAR58CLKSource=RCC_XBAR_CLKSRC_PLL4
RCC.XBAR58Findiv=30
RCC.XBAR58Prediv=2
RCC.XBAR59Findiv=3
RCC.XBAR63CLKSource=RCC_XBAR_CLKSRC_PLL6
RCC.XBAR63Findiv=4
RIF.-0=ETR_CID_RIMU
RIF.-1=SDMMC1_CID_RIMU
RIF.-10=DCMIPP_CID_RIMU
RIF.-14=VDEC_CID_RIMU
RIF.-15=VENC_CID_RIMU
RIF.-2=SDMMC2_CID_RIMU
RIF.-3=SDMMC3_CID_RIMU
RIF.-4=USB3DR_CID_RIMU
RIF.-5=USBH_CID_RIMU
RIF.-6=ETH1_CID_RIMU
RIF.-7=ETH2_CID_RIMU
RIF.-8=PCIE_CID_RIMU
RIF.-9=GPU_CID_RIMU
RIF.GPU_CID_RIMU=1
RIF.IPParameters=-0,-1,-2,-3,-4,-5,-6,-7,-8,-9,-10,-14,-15,GPU_CID_RIMU,SDMMC1_CID_RIMU,USBH_CID_RIMU,USB3DR_CID_RIMU
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_CMN\ Secure=false
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_RDFIFO\ Secure=false
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ Cid=1
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ CortexA35NSOS=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ CortexA35NSSSBL=true
RIF.RIFAWARE.DSIHOST\ Feature\ DSI_TRIG\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_CFG\ Cid=-
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_CFG\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_MSGBUF\ Cid=-
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_ACM_MSGBUF\ Secure=false
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_DEIP\ Cid=-
RIF.RIFAWARE.ETHSW\ Feature\ ETHSW_DEIP\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ COMBOPHY\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ CPU1\ SEV\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ CPU2\ SEV\ interrupt\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ CPU2\ SYSRESETREQ\ local\ CPU2\ reset\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ DTS\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ DTS\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ ETH1_PMT\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ ETH2_PMT\ wakeup\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[0]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[0]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[10]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[10]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[11]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[11]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[12]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[12]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[13]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[14]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[14]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[15]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[15]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[1]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[1]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[2]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[2]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[3]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[4]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[5]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[5]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[6]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[6]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[7]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[7]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[8]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[8]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[9]\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ EXTI1[9]\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA1\ Channel\ 0\ to\ 15\ CPU1\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA1\ Channel\ 0\ to\ 15\ CPU2\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA2\ Channel\ 0\ to\ 15\ CPU1\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA2\ Channel\ 0\ to\ 15\ CPU2\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA3\ Channel\ 0\ to\ 15\ CPU1\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ HPDMA3\ Channel\ 0\ to\ 15\ CPU2\ irq\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C4\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C4\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C5\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C5\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I2C6\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ CortexA35SFSBLA=true
RIF.RIFAWARE.EXTI1\ Feature\ I2C7\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ I3C1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I3C2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ I3C3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ I3C3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ CortexA35NSOS=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ Cid=2
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ CortexM33NS=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ non\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ Cid=1
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ CortexA35SSecureOS=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU1\ Secure=true
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ IPCC1\ secure\ interrupt\ CPU2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ LPTIM2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ PVD\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ PVM\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ RCC_HSI_FMON\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI1\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI2\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI2\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI3\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI3\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI4\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI4\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI5\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI5\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI6\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI6\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ SPI7\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ SPI7\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART4\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART4\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART5\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART5\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART7\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART7\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART8\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART8\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UART9\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UART9\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ DETECT\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ DETECT\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ VSAFE5V\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ UCPD\ VBUS\ VSAFE5V\ Secure=false
RIF.RIFAWARE.EXTI1\ Feature\ USART1\ Cid=-
RIF.RIFAWARE.EXTI1\ Feature\ USART1\ Secure=false
