4ms/mp153-devboard/mp257/cubemx/mp257-devboard/mp257-devboard.ioc
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ RDCR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RETRAM_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ RTC_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ SRAM1_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ SRAM2_CFGR\ Secure=false
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCLK\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSCPU1_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ BootROMA35=true
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRAM_CFGR\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Cid=1
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SFSBLA=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ CortexA35SSecureOS=true
RIF.RIFAWARE.RCC\ Feature\ SYSRST\ Secure=true
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Cid=-
RIF.RIFAWARE.RCC\ Feature\ VDERAM_CFGR\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Alarm\ A\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Alarm\ B\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Calibration\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Initialization\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Timestamp\ Secure=false
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Cid=-
RIF.RIFAWARE.RTC\ Feature\ Wakeup\ timer\ Secure=false
RIF.RIFAWARE.TAMP\ End\ Address=1174471424
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Cid=-
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 0\ Secure=false
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ BootROMA35=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Cid=1
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SFSBLA=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ CortexA35SSecureOS=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 1\ Secure=true
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Cid=-
RIF.RIFAWARE.TAMP\ Feature\ Resource\ 2\ Secure=false
RIF.RIFAWARE.TAMP\ Size=512
RIF.RIFAWARE.TAMP\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone1-RIF1\ Size=512
RIF.RIFAWARE.Zone1-RIF1\ Start\ Address=1174470912
RIF.RIFAWARE.Zone1-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone1-RIF2\ Size=0
RIF.RIFAWARE.Zone1-RIF2\ Start\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF1\ Size=0
RIF.RIFAWARE.Zone2-RIF1\ Start\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone2-RIF2\ Size=0
RIF.RIFAWARE.Zone2-RIF2\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF0\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF0\ Size=0
RIF.RIFAWARE.Zone3-RIF0\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF1\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF1\ Size=0
RIF.RIFAWARE.Zone3-RIF1\ Start\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF2\ End\ Address=1174471424
RIF.RIFAWARE.Zone3-RIF2\ Size=0
RIF.RIFAWARE.Zone3-RIF2\ Start\ Address=1174471424
RIF.RISUP.CRYP1.Lock=true
RIF.RISUP.CRYP2.Lock=true
RIF.RISUP.IWDG5.Lock=true
RIF.RISUP.OTFDEC1.Lock=true
RIF.RISUP.OTFDEC2.Lock=true
RIF.RISUP.PKA.Lock=true
RIF.RISUP.RAMCFG.Privilege=true
RIF.RISUP.SAES.Lock=true
RIF.SDMMC1_CID_RIMU=1
RIF.USB3DR_CID_RIMU=1
RIF.USBH_CID_RIMU=1
RIF.default_config=true
SAI1.ErrorAudioFreq-SAI_A_MasterWithClock=47.5 %
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MckOutput-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,InitProtocol-SAI_A_MasterWithClock,VirtualProtocol-SAI_A_BASIC,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave
SAI1.InitProtocol-SAI_A_MasterWithClock=Enable
SAI1.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
SAI1.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
SAI1.MckOutput-SAI_A_MasterWithClock=SAI_MCK_OUTPUT_ENABLE
SAI1.RealAudioFreq-SAI_A_MasterWithClock=283.203 KHz
SAI1.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
SAI1.VirtualMode-SAI_B_SyncSlave=VM_SLAVE
SAI1.VirtualProtocol-SAI_A_BASIC=VM_BASIC_PROTOCOL
SAI2.ErrorAudioFreq-SAI_B_Master=30.2 %
SAI2.IPParameters=Instance-SAI_B_Master,VirtualMode-SAI_B_Master,MckOutput-SAI_B_Master,RealAudioFreq-SAI_B_Master,ErrorAudioFreq-SAI_B_Master,Instance-SAI_A_SyncSlave,VirtualMode-SAI_A_SyncSlave
SAI2.Instance-SAI_A_SyncSlave=SAI$Index_Block_A
SAI2.Instance-SAI_B_Master=SAI$Index_Block_B
SAI2.MckOutput-SAI_B_Master=SAI_MCK_OUTPUT_DISABLE
SAI2.RealAudioFreq-SAI_B_Master=250.0 KHz
SAI2.VirtualMode-SAI_A_SyncSlave=VM_SLAVE
SAI2.VirtualMode-SAI_B_Master=VM_MASTER
SH.SharedStack_PG3.0=SAI2_FS_B,SAI_B_Master
SH.SharedStack_PG3.1=ADC1_INP3
SH.SharedStack_PG3.ConfNb=2
USB3DR_DM.GPIOParameters=PinAttribute
USB3DR_DM.Mode=Dual_Role_mode_USB2
USB3DR_DM.PinAttribute=BootROMA35,CortexA35SSecureOS
USB3DR_DM.Signal=USB3DR_DM
USB3DR_DP.GPIOParameters=PinAttribute
USB3DR_DP.Mode=Dual_Role_mode_USB2
USB3DR_DP.PinAttribute=BootROMA35,CortexA35SSecureOS
USB3DR_DP.Signal=USB3DR_DP
USB3DR_TXRTUNE.GPIOParameters=PinAttribute
USB3DR_TXRTUNE.Mode=Dual_Role_mode_USB2
USB3DR_TXRTUNE.PinAttribute=BootROMA35,CortexA35SSecureOS
USB3DR_TXRTUNE.Signal=USB3DR_TXRTUNE
USBH_HS_DM.GPIOParameters=PinAttribute
USBH_HS_DM.Mode=Enable
USBH_HS_DM.PinAttribute=CortexA35SFSBLA
USBH_HS_DM.Signal=USBH_HS_DM
USBH_HS_DP.GPIOParameters=PinAttribute
USBH_HS_DP.Mode=Enable
USBH_HS_DP.PinAttribute=CortexA35SFSBLA
USBH_HS_DP.Signal=USBH_HS_DP
USBH_HS_TXRTUNE.GPIOParameters=PinAttribute
USBH_HS_TXRTUNE.Mode=Enable
USBH_HS_TXRTUNE.PinAttribute=CortexA35SFSBLA
USBH_HS_TXRTUNE.Signal=USBH_HS_TXRTUNE
VP_BSEC_VS_BSEC.Mode=BSEC_Activate
VP_BSEC_VS_BSEC.Signal=BSEC_VS_BSEC
VP_CORTEX_M33_VS_CORTEX_M33.Mode=CORTEX_M33_Activate
VP_CORTEX_M33_VS_CORTEX_M33.Signal=CORTEX_M33_VS_CORTEX_M33
VP_DCACHE_VS_DCACHE.Mode=DCACHE_Activate
VP_DCACHE_VS_DCACHE.Signal=DCACHE_VS_DCACHE
VP_DDR_CTRL_PHY_DDR4.Mode=DDR4
VP_DDR_CTRL_PHY_DDR4.Signal=DDR_CTRL_PHY_DDR4
VP_DDR_CTRL_PHY_VS_16BITS.Mode=16bits
VP_DDR_CTRL_PHY_VS_16BITS.Signal=DDR_CTRL_PHY_VS_16BITS
VP_DDR_CTRL_PHY_VS_4Gb.Mode=4Gb
VP_DDR_CTRL_PHY_VS_4Gb.Signal=DDR_CTRL_PHY_VS_4Gb
VP_GPU_VS_GPU.Mode=GPU_Activate
VP_GPU_VS_GPU.Signal=GPU_VS_GPU
VP_ICACHE_VS_ICACHE.Mode=DefaultMode
VP_ICACHE_VS_ICACHE.Signal=ICACHE_VS_ICACHE
VP_OCTOSPI1_VS_FlashMemoryPageSizeSig.Mode=256B
VP_OCTOSPI1_VS_FlashMemoryPageSizeSig.Signal=OCTOSPI1_VS_FlashMemoryPageSizeSig
VP_OCTOSPI1_VS_FlashMemoryTypeSig.Mode=NOR
VP_OCTOSPI1_VS_FlashMemoryTypeSig.Signal=OCTOSPI1_VS_FlashMemoryTypeSig
VP_OCTOSPI1_VS_quad.Mode=quad_mode
VP_OCTOSPI1_VS_quad.Signal=OCTOSPI1_VS_quad
VP_OCTOSPIM_VS_IO.Mode=Direct
VP_OCTOSPIM_VS_IO.Signal=OCTOSPIM_VS_IO
VP_RIF_VS_RIF1.Mode=RISUP
VP_RIF_VS_RIF1.Signal=RIF_VS_RIF1
VP_SAI1_VP_$IpInstance_SAIA_SAI_BASIC.Mode=SAI_A_BASIC
VP_SAI1_VP_$IpInstance_SAIA_SAI_BASIC.Signal=SAI1_VP_$IpInstance_SAIA_SAI_BASIC
VP_STGEN_VS_STGEN.Mode=STGEN_Activate
VP_STGEN_VS_STGEN.Signal=STGEN_VS_STGEN
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=custom
